// 5. Написать программу вычисления значения функции y = f(a)

double y(double x)
{
    return Math.Sin(x);
}
Console.WriteLine(y(30));
